CFDPipeline_Nextflow/casedir/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    ( 0  0   0 )    // 0
    ( 7  0   0 )    // 1
    ( 7  1 0 )    // 2
    ( 0  1 0 )    // 3
    ( 0  0   1 )    // 4
    ( 7  0   1 )    // 5
    ( 7  1 1 )    // 6
    ( 0  1 1 )    // 7
    ( 0  0   2 )    // 8
    ( 7  0   2 )    // 9
    ( 7  1 2 )    // 10
    ( 0  1 2 )    // 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (70 10 20) simpleGrading   (1 1 1)
    hex (4 5 6 7 8 9 10 11) (70 10 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    ground
    {
        type wall;
        faces
        (
            (0 1 4 5)
            (4 5 8 9)
        );
    }

    sides
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (8 9 10 11)
        );
    }
    
    front
    {
        type patch;
        faces
        (
            (0 4 3 7)
            (4 8 7 11)
        );
    }

    back
    {
        type patch;
        faces
        (
            (1 5 2 6)
            (5 9 6 10)
        );
    }

    top
    {
       type patch;
       faces
       (
           (3 2 7 6 )
           (7 6 11 10)
       );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
